# 11 Задание на объем сообщения

# i или глубина кодирования или объем одного символа - это сколькими символами кодируется одна буква. например если нам надо закодировать 8 букв, то нужно иметь глубину кодирования 2 ** i == 8, следовательно i == 3

# N или мощность алфавита или сколько символов можно закодировать, она обозначается как N и находится как 2 ** i, где i - это глубина кодирования или объем одного символа.  Мощность алфавита обозначает сколько символов включает в себя этот алфавит, например мощность русского алфавита 33

# L или кол-во символов в сообщении или из скольки букв и знаков состоит наш текст 

# V или объем текста, сообщения или еще чего-то состоящего из букв. Находится как L * i или подругому кол-во символов на объем одного символа

# !!! Обязательно читать на каком моменте нас просят перевести байты в биты или еще что то перевести, от этого будет зависить ответ